; \a b c d: (a b c d) == (a (b (c (d))))  // LISPなので
1 = (succ 0)
2 = (succ 1)
3 = (succ 2)
4 = (succ 3)
5 = (succ 4)
6 = (succ 5)
7 = (succ 6)
8 = (succ 7)
9 = (succ 8)
2 = (1 + 1)
3 = (2 + 1)
4 = (3 + 1)
;5 = (4 + 1)
;[x: 1 2 3] (succ x) = (x + 1) ; この仮説をこのあたりでたててほしい
; あくまで簡約のために？
![x] 6 = (x + 1) ; ↑の仮説を使ってこれの x を導いて欲しい
3 = (1 + 2)
4 = (1 + 3)
;[x] (1 + x) = (x + 1); これを導いて欲しい
5 = (2 + 3)

- ... 99 == (succ 98)
- 2 == (take 0 (2 1 0))
- 2 == (1 + 1)
- 3 == (2 + 1)
- 4 == (3 + 1)
- \x: (succ x) == (x + 1)
- \x y: (x + y) == (y + x)
- \x: (x + x) == (2 * x)
- 3 := (1 + 1 + 1)
- (x ^ 2 + 2 x + 1) == ( '( x + 1 ') ^ 2 )
- (x ^ 2 + 4 x + 4) == ( '( x + 2 ') ^ 2 )
- (x ^ 2 + 6 x + 9) == ( '( x + 2 ') ^ 2 )
